<template>
  <div>
    <h2
      class="text-h6 text-weight-900 q-mt-none"
      :class="$q.screen.gt.sm ? 'q-mb-lg' : 'q-mb-md'"
    >
      برای مطالعه (حال داشتی بخون)
    </h2>
    <q-card bordered class="no-shadow full-width">
      <q-card-section :class="$q.screen.gt.sm ? 'q-pa-xl' : 'q-pa-lg'">
        <div class="column justify-start">
          <p class="text-body1 no-margin no-letter-spacing">
            اگر بخواهیم کلمه "جذر" را معنی کنیم، باید گفت در لغت به معنی "بن"،
            "پایه" و یا "ریشه" میباشد. پس وقتی میخواهیم به جذر یک عدد برسیم باید
            ریشه آن عدد را به دست آوردیم.
          </p>
          <p class="text-body1 q-mt-md no-letter-spacing">
            جذر یک مفهوم مهم در ریاضیات و علوم کامپیوتر است که به معنی این است
            که چه عدی را به توان دو برسانیم تا عدد مورد نظر نظر ما حاصل شود. به
            بیان ساده تر جذر همان رادیکال است.
          </p>

          <div class="q-mt-md">
            <p class="text-body1 text-weight-600 text-grey-7 no-letter-spacing">
              به طور مثال برای محاسبه جذر عدد 9 در واقع آن را زیر رادیکال میبریم
            </p>
            <p class="text-h6 text-bold rtl text-left">√9 = 3</p>

            <h2
              class="text-h6 text-weight-900 q-pt-md"
              :class="$q.screen.gt.sm ? 'q-my-lg' : 'q-my-md'"
            >
              ریشه های بالاتر از2
            </h2>
            <p class="text-body1 no-margin no-letter-spacing">
              تا به اینجا گفتیم که جذر به معنی این است که چه عددی به توان دو
              رسیده تا عدد مورد نظر ما حاصل شده، در واقع جذر همان ریشه دوم عدد
              است که جوابی نا منفی دارد. (پاسخ عددی که زیر رادیکال است همیشه
              مثبت است و عدد زیر رادیکال هم نمیتواند منفی باشد. اما اگر علامت
              منفی را قبل از رادیکال قرار دهیم پاسخ جذر را هم باید منفی به دست
              آوریم) اما اگر بخواهیم بدانیم مثلا چه عددی 3 بار در خود ضرب شده
              چه؟ 4 بار چطور؟
            </p>
            <p class="text-body1 q-mt-md q-mb-none no-letter-spacing">
              به جز ریشه دوم ما میتوانیم ریشه های دیگر هر عددی را نیز محاسبه
              کنیم اما اصولا ریشه دوم و بعد آن هم ریشه سوم پر کاربردتر است.
            </p>
            <p
              class="text-body1 q-mt-md q-mb-none text-red-8 no-letter-spacing"
            >
              به طور کلی وقتی جایی از شما خواسته شد ریشه عددی را محاسبه کنید و
              اشاره ای به این که ریشه چندم مدنظر است نشد، منظور همان جذر یا ریشه
              دوم است. در تنبل باشی هم ریشه دوم هر عدد محاسبه میشود.
            </p>
            <p class="text-body1 q-mt-md no-letter-spacing">
              در ادامه نکات بیشتری در مورد ریشه های زوج(مثلا ریشه دوم یا چهارم)
              و ریشه های فرد(مثلا ریشه سوم یا پنج) هر عدد بیان میکنیم.
            </p>

            <h2
              class="text-h6 text-weight-900 q-pt-md"
              :class="$q.screen.gt.sm ? 'q-my-lg' : 'q-my-md'"
            >
              ریشه های زوج
            </h2>
            <p class="text-body1 no-margin no-letter-spacing">
              <span class="text-red-8"> اعداد منفی ریشه زوج ندارند</span>
              چون هیچ عددی (چه مثبت و چه منفی) را نمیتوانید پیدا کنید که مثلا
              دوبار یا چهاربار در خود ضرب شود و حاصل آن منفی باشد. پس اگر عددی
              منفی بود میتوانید مطمئن باشید که نمیتوان از آن ریشه زوج به دست
              آورد.
            </p>
            <p class="text-body1 q-mt-md q-mb-none no-letter-spacing">
              اگر عددی که قصد جذر گرفتن از آن را داشتید مثبت بود پس از آن عدد
              میتوان ریشه های زوج به دست آورد. مثلا میتوانید ریشه دوم، چهارم،
              و... آن را به دست آورید. اما به این نکته توجه کنید که هر عدد حقیقی
              مثبت، برای هر ریشه زوج دارای دو جواب است که قرینه هم هستند.
            </p>
            <p class="text-body1 q-my-md text-grey-7 no-letter-spacing">
              مثلا ریشه چهارم عدد 16:
            </p>
            <p class="text-h6 no-margin text-bold rtl text-left">
              (-2) * (-2) * (-2) * (-2) = 16
            </p>
            <p class="text-h6 text-bold rtl text-left">2 * 2 * 2 * 2 = 16</p>
            <p class="text-body1 q-mt-md q-mb-none no-letter-spacing">
              پس هم منفی دو و هم مثبت دو ریشه های چهارم 16 هستند. و ریشه دوم عدد
              25 هم منفی 5 و مثبت 5 است. برای بقیه ریشه های زوج هم این مساله
              صادق است.
            </p>

            <h2
              class="text-h6 text-weight-900 q-pt-md"
              :class="$q.screen.gt.sm ? 'q-my-lg' : 'q-my-md'"
            >
              ریشه های فرد
            </h2>
            <p class="text-body1 no-margin text-red-8 no-letter-spacing">
              اعداد منفی میتوانند ریشه فرد داشته باشند
            </p>
            <p class="text-body1 q-mt-md q-mb-none no-letter-spacing">
              برعکس ریشه های زوج، که گفیتم تنها اعداد مثبت دارای ریشه زوج هستند
              اما در مورد ریشه های فرد اینطور نیست. هر عدد حقیقی چه مثبت و چه
              منفی میتواند ریشه های فرد داشته باشد اما دقت کنید که این بار برای
              هر ریشه فرد، یک جواب داریم که با عدد ما هم علامت است.
            </p>
            <p class="text-body1 q-mt-md q-mb-none no-letter-spacing">
              مثلا اگر عددی منفی داریم که میخواهیم ریشه سوم آن را به دست آوریم
              جواب تنها یک عدد است که علامت آن هم منفیست. یا اگر برای عددی مثبت
              به دنبال ریشه سوم باشیم ریشه سوم آن هم حتما مثبت است.
            </p>
            <p class="text-body1 q-my-md text-grey-7 no-letter-spacing">
              مثلا ریشه سوم عدد 125 فقط عدد 5 است و منفی 5 نمیتواند ریشه سوم آن
              باشد و ریشه سوم منفی 125 هم تنها منفی 5 است.
            </p>
            <p class="text-h6 no-margin text-bold rtl text-left">
              5 * 5 * 5 = 125
            </p>
            <p class="text-h6 text-bold rtl text-left">
              (-5) * (-5) * (-5) = -125
            </p>
            <p
              class="text-body1 q-mt-md q-mb-none text-weight-700 no-letter-spacing"
            >
              پس هر عدد حقیقی مثبت دارای دو ریشه به ازای هر ریشه زوج است. و هر
              عدد حقیقی چه مثبت و چه منفی دارای یک ریشه هم علامت با خودش به ازای
              هر ریشه فرد میباشد
            </p>
          </div>
        </div>
      </q-card-section>
    </q-card>
    <frequently-asked-questions :data="faqData" class="q-mt-xl" />
  </div>
</template>

<script setup>
import { ref } from "vue";
import FrequentlyAskedQuestions from "src/components/shared/FAQ.vue";

const faqData = ref([
  {
    title: "جذر اعداد منفی را چطور محاسبه کنیم؟",
    description: `
اعداد منفی جذر زوج ندارند چون هیچ عددی را نمیتوانید پیدا کنید که مجذور آن منفی باشد. حتی یک عدد منفی هم وقتی به تعداد زوج در خودش ضرب میشود پاسخ عددی مثبت است.
و از آنجا که معمولا منظور از جذر عدد، ریشه دوم آن است پس میگوییم اعداد منفی دارای جذر نیستند.(مگر این که منظور مثلا جذر سوم آن باشد)
که در این صورت دارای یک ریشه به ازای هر عدد فرد هستند
`,
  },
  {
    title: "ریشه 0 و 1 چه عددیست؟",
    description: `
   عدد صفر و یک ریشه‌شان همیشه و در هر ریشه‌ای چه زوج و چه فرد، برابر با خودشان است.
 البته توجه کنید که برای عدد 1 اگر بخواهید ریشه زوج بگیرید جواب آن هم منفی 1 و هم مثبت 1 است. اما منفی 1 تنهای دارای ریشه های فرد است که جواب آن هم در هر پایه ای برابر با منفی 1 است.
    `,
  },
  {
    title: "تفاوت جذر و مجذور چیست؟",
    description: `
     جذر به این معنیست که چه عدد مثبتی به توان دو رسیده که عدد مورد نظر ما حاصل شده اما مجذور یک عدد یعنی آن عدد اگر به توان دو برسد به چه عددی میرسیم. جذر و مجذور نقطه مقابل یکدیگر هستند.
      جذر 9 عدد 3 است و مجذور 3 عدد 9 است.
    `,
  },
  {
    title: "تفاوت جذر و ریشه دوم چیست؟",
    description: `
    جذر ریشه دوم عدد است که باید مثبت باشد. اما ریشه دوم دو جواب دارد که یکی مثبت و یکی منفی است. (قرینه همدیگر هستند)
    `,
  },
]);
</script>
